{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"getting":404,"started":405,"install":406,"pip":407,"getting_started":408,"installation":409,"gpu":410,"index":411,"build":412,"wheel":413,"bash":414,"visit":415,"quickstart":416,"welcome":417,"any":418,"collaborations":419,"how":420,"get":421,"involved":422,"sponsors":423,"compute":424,"resources":425,"testing":426,"following":427,"organizations":428,"thank":429,"your":430,"note":431,"sort":432,"them":433,"alphabetical":434,"order":435,"keep":436,"consistent":437,"md":438,"cash":439,"donations":440,"dropbox":441,"sequoia":442,"capital":443,"skywork":444,"zhenfund":445,"alibaba":446,"anyscale":447,"crusoe":448,"databricks":449,"deepinfra":450,"lambda":451,"nebius":452,"novita":453,"replicate":454,"runpod":455,"trainy":456,"san":457,"diego":458,"sponsor":459,"also":460,"official":461,"fundraising":462,"venue":463,"through":464,"opencollective":465,"plan":466,"fund":467,"maintenance":468,"adoption":469,"citation":470,"cite":471,"bibtex":472,"inproceedings":473,"kwon2023efficient":474,"title":475,"language":476,"author":477,"woosuk":478,"kwon":479,"zhuohan":480,"li":481,"siyuan":482,"zhuang":483,"ying":484,"sheng":485,"lianmin":486,"zheng":487,"cody":488,"hao":489,"yu":490,"joseph":491,"gonzalez":492,"zhang":493,"ion":494,"stoica":495,"booktitle":496,"proceedings":497,"acm":498,"sigops":499,"29th":500,"symposium":501,"operating":502,"systems":503,"principles":504,"year":505,"contact":506,"start":507,"technical":508,"questions":509,"feature":510,"github":511,"issues":512,"fellow":513,"security":514,"disclosures":515,"advisories":516,"partnerships":517,"lists":518,"mailto":519,"end":520,"kit":521,"wish":522,"refer":523,"repo":524,"releasing":525,"releases":526,"offer":527,"reliable":528,"version":529,"base":530,"packaged":531,"binary":532,"format":533,"can":534,"conveniently":535,"accessed":536,"via":537,"pypi":538,"serve":539,"milestones":540,"communicate":541,"newly":542,"available":543,"improvements":544,"upcoming":545,"changes":546,"could":547,"affect":548,"potential":549,"breaking":550,"versioning":551,"uses":552,"right":553,"shifted":554,"where":555,"new":556,"patch":557,"every":558,"weeks":559,"contain":560,"bug":561,"fixes":562,"opposed":563,"semver":564,"contains":565,"only":566,"backwards":567,"when":568,"critical":569,"need":570,"made":571,"post1":572,"_major_":573,"milestone":574,"incompatible":575,"similar":576,"_minor_":577,"_patch_":578,"_post1_":579,"_patch":580,"1_":581,"either":582,"explicit":583,"implicit":584,"cadence":585,"bi":586,"weekly":587,"basis":588,"days":589,"after":590,"same":591,"branch":592,"all":593,"future":594,"dates":595,"below":596,"tentative":597,"optional":598,"date":599,"versions":600,"jan":601,"feb":602,"mar":603,"apr":604,"jun":605,"jul":606,"13":607,"aug":608,"14":609,"15":610,"sep":611,"16":612,"17":613,"oct":614,"18":615,"19":616,"nov":617,"21":618,"dec":619,"22":620,"each":621,"built":622,"dedicated":623,"cut":624,"performed":625,"before":626,"previously":627,"reused":628,"builds":629,"triggered":630,"push":631,"rc":632,"tag":633,"vx":634,"rc1":635,"enables":636,"test":637,"multiple":638,"rcs":639,"final":640,"does":641,"trigger":642,"used":643,"notes":644,"monitor":645,"reverts":646,"apply":647,"cherry":648,"pick":649,"criteria":650,"approach":651,"finalizing":652,"clear":653,"what":654,"picks":655,"allowed":656,"process":657,"land":658,"pr":659,"typically":660,"ensure":661,"sufficient":662,"time":663,"complete":664,"thorough":665,"round":666,"stable":667,"regression":668,"address":669,"functional":670,"performance":671,"against":672,"recent":673,"severe":674,"issue":675,"silent":676,"incorrectness":677,"compatibility":678,"crashes":679,"deadlocks":680,"leaks":681,"introduced":682,"specific":683,"change":684,"identifiers":685,"ci":686,"work":687,"prs":688,"considered":689,"merged":690,"trunk":691,"exception":692,"manual":693,"validations":694,"e2e":695,"validation":696,"perform":697,"regressions":698,"benchmark":699,"workflow":700,"actions":701,"workflows":702,"yml":703,"current":704,"coverage":705,"llama3":706,"llama4":707,"hardware":708,"h100":709,"mi300x":710,"_note":711,"based":712,"availability_":713,"step":714,"access":715,"request":716,"write":717,"repository":718,"run":719,"review":720,"setup":721,"familiarize":722,"yourself":723,"configurations":724,"tree":725,"benchmarks":726,"rocm":727,"navigate":728,"configure":729,"set":730,"v0":731,"commit":732,"hash":733,"results":734,"once":735,"completes":736,"dashboard":737,"hud":738,"reponame":739,"2fvllm":740,"corresponding":741,"comparison":742,"compare":743,"verify":744,"occurred":745,"example":746,"vs":747,"starttime":748,"thu":749,"2c":750,"2017":751,"20apr":752,"202025":753,"2021":754,"3a43":755,"3a50":756,"20gmt":757,"stoptime":758,"wed":759,"2016":760,"20jul":761,"granularity":762,"week":763,"lbranch":764,"lcommit":765,"b6553be1bc75f046b00046a4ad7576364d03c835":766,"rbranch":767,"rcommit":768,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":769,"benchmarkname":770,"modelname":771,"20models":772,"backendname":773,"20backends":774,"modename":775,"20modes":776,"dtypename":777,"20dtype":778,"devicename":779,"20devices":780,"archname":781,"20platforms":782,"conduct":783,"pledge":784,"members":785,"leaders":786,"make":787,"participation":788,"harassment":789,"experience":790,"regardless":791,"age":792,"body":793,"size":794,"visible":795,"invisible":796,"disability":797,"ethnicity":798,"sex":799,"characteristics":800,"gender":801,"identity":802,"expression":803,"level":804,"education":805,"socioeconomic":806,"status":807,"nationality":808,"personal":809,"appearance":810,"race":811,"caste":812,"religion":813,"sexual":814,"orientation":815,"act":816,"interact":817,"ways":818,"contribute":819,"welcoming":820,"diverse":821,"inclusive":822,"healthy":823,"standards":824,"examples":825,"behavior":826,"contributes":827,"positive":828,"environment":829,"include":830,"demonstrating":831,"empathy":832,"kindness":833,"toward":834,"people":835,"being":836,"respectful":837,"differing":838,"opinions":839,"viewpoints":840,"experiences":841,"giving":842,"gracefully":843,"accepting":844,"constructive":845,"feedback":846,"responsibility":847,"apologizing":848,"those":849,"affected":850,"mistakes":851,"learning":852,"best":853,"individuals":854,"overall":855,"unacceptable":856,"sexualized":857,"imagery":858,"advances":859,"kind":860,"trolling":861,"insulting":862,"derogatory":863,"comments":864,"political":865,"attacks":866,"public":867,"private":868,"publishing":869,"others":870,"physical":871,"email":872,"without":873,"permission":874,"which":875,"reasonably":876,"inappropriate":877,"professional":878,"setting":879,"enforcement":880,"responsibilities":881,"responsible":882,"clarifying":883,"enforcing":884,"acceptable":885,"take":886,"appropriate":887,"fair":888,"corrective":889,"action":890,"response":891,"deem":892,"threatening":893,"offensive":894,"harmful":895,"remove":896,"reject":897,"commits":898,"wiki":899,"edits":900,"aligned":901,"reasons":902,"moderation":903,"decisions":904,"scope":905,"applies":906,"within":907,"spaces":908,"individual":909,"representing":910,"using":911,"posting":912,"social":913,"account":914,"acting":915,"appointed":916,"representative":917,"online":918,"offline":919,"irl":920,"instances":921,"abusive":922,"harassing":923,"otherwise":924,"reported":925,"channel":926,"complaints":927,"reviewed":928,"investigated":929,"promptly":930,"fairly":931,"obligated":932,"respect":933,"privacy":934,"reporter":935,"incident":936,"guidelines":937,"follow":938,"impact":939,"determining":940,"consequences":941,"violation":942,"correction":943,"deemed":944,"unprofessional":945,"unwelcome":946,"consequence":947,"written":948,"warning":949,"clarity":950,"around":951,"nature":952,"explanation":953,"why":954,"apology":955,"requested":956,"single":957,"series":958,"continued":959,"interaction":960,"unsolicited":961,"specified":962,"period":963,"includes":964,"avoiding":965,"interactions":966,"well":967,"external":968,"channels":969,"violating":970,"terms":971,"lead":972,"temporary":973,"permanent":974,"ban":975,"serious":976,"sustained":977,"communication":978,"during":979,"pattern":980,"aggression":981,"disparagement":982,"classes":983,"attribution":984,"adapted":985,"contributor":986,"covenant":987,"code_of_conduct":988,"were":989,"inspired":990,"mozilla":991,"ladder":992,"inclusion":993,"answers":994,"common":995,"see":996,"faq":997,"translations":998,"policy":999,"reporting":1000,"report":1001,"privately":1002,"vulnerability":1003,"submission":1004,"form":1005,"triage":1006,"reports":1007,"triaged":1008,"vulnerability_management":1009,"threat":1010,"guide":1011,"usage":1012,"assumptions":1013,"recommendations":1014,"blob":1015,"securely":1016,"severity":1017,"determine":1018,"risk":1019,"taking":1020,"dealing":1021,"past":1022,"defaults":1023,"cases":1024,"categories":1025,"vulnerabilities":1026,"allow":1027,"remote":1028,"attackers":1029,"execute":1030,"arbitrary":1031,"control":1032,"system":1033,"significantly":1034,"compromise":1035,"confidentiality":1036,"integrity":1037,"privileges":1038,"needed":1039,"network":1040,"deserialization":1041,"exploit":1042,"chains":1043,"generally":1044,"rated":1045,"cvss":1046,"flaws":1047,"elevated":1048,"rce":1049,"contexts":1050,"significant":1051,"loss":1052,"require":1053,"advanced":1054,"conditions":1055,"some":1056,"trust":1057,"modes":1058,"node":1059,"privileged":1060,"required":1061,"scores":1062,"between":1063,"moderate":1064,"cause":1065,"denial":1066,"service":1067,"partial":1068,"disruption":1069,"do":1070,"breach":1071,"rating":1072,"low":1073,"minor":1074,"informational":1075,"logging":1076,"errors":1077,"non":1078,"exploitable":1079,"weaknesses":1080,"local":1081,"privilege":1082,"negligible":1083,"side":1084,"collisions":1085,"often":1086,"less":1087,"than":1088,"prenotification":1089,"certain":1090,"prenotify":1091,"vendors":1092,"ship":1093,"purpose":1094,"coordinated":1095,"notification":1096,"adding":1097,"contacts":1098,"advisory":1099,"few":1100,"added":1101,"group":1102,"send":1103,"copying":1104,"vendor":1105,"analyzed":1106,"case":1107,"withdraw":1108,"receiving":1109,"prenotifications":1110,"membership":1111,"refinements":1112,"who":1113,"included":1114,"hide":1115,"navigation":1116,"toc":1117,"figure":1118,"markdown":1119,"span":1120,"class":1121,"60":1122,"style":1123,"strong":1124,"script":1125,"async":1126,"defer":1127,"buttons":1128,"io":1129,"js":1130,"button":1131,"show":1132,"count":1133,"true":1134,"aria":1135,"label":1136,"star":1137,"subscription":1138,"icon":1139,"octicon":1140,"eye":1141,"watch":1142,"fork":1143,"forked":1144,"depends":1145,"type":1146,"looking":1147,"recommend":1148,"starting":1149,"applications":1150,"roadmap":1151,"gaudi":1152,"accelerators":1153,"power":1154,"trainium":1155,"inferentia":1156,"announcing":1157,"intro":1158,"sosp":1159,"23x":1160,"while":1161,"reducing":1162,"p50":1163,"latency":1164,"cade":1165,"daniel":1166,"et":1167,"al":1168,"meetups":1169,"benchmarking":1170,"readme":1171,"guides":1172,"running":1173,"tests":1174,"extensive":1175,"datasets":1176,"living":1177,"document":1178,"updated":1179,"become":1180,"dataset":1181,"overview":1182,"table":1183,"100":1184,"border":1185,"collapse":1186,"thead":1187,"tr":1188,"th":1189,"left":1190,"65":1191,"path":1192,"tbody":1193,"td":1194,"sharegpt":1195,"wget":1196,"co":1197,"anon8231489123":1198,"sharegpt_vicuna_unfiltered":1199,"resolve":1200,"sharegpt_v3_unfiltered_cleaned_split":1201,"json":1202,"sharegpt4v":1203,"image":1204,"lin":1205,"chen":1206,"sharegpt4v_instruct_gpt4":1207,"vision_cap100k":1208,"br":1209,"div":1210,"images":1211,"downloaded":1212,"separately":1213,"download":1214,"coco":1215,"train":1216,"http":1217,"cocodataset":1218,"zips":1219,"train2017":1220,"zip":1221,"burstgpt":1222,"hpmll":1223,"burstgpt_without_fails_2":1224,"csv":1225,"sonnet":1226,"deprecated":1227,"txt":1228,"random":1229,"synthetic":1230,"repetition":1231,"visionarena":1232,"lmarena":1233,"instructcoder":1234,"likaixin":1235,"aimo":1236,"mo":1237,"aime":1238,"numinamath":1239,"cot":1240,"lmms":1241,"onevision":1242,"aeala":1243,"custom":1244,"jsonl":1245,"name":1246,"should":1247,"hf":1248,"nousresearch":1249,"hermes":1250,"8b":1251,"bench":1252,"backend":1253,"endpoint":1254,"completions":1255,"num":1256,"prompts":1257,"successful":1258,"output":1259,"result":1260,"duration":1261,"78":1262,"total":1263,"input":1264,"tokens":1265,"1369":1266,"generated":1267,"2212":1268,"req":1269,"73":1270,"token":1271,"tok":1272,"382":1273,"89":1274,"619":1275,"85":1276,"mean":1277,"ttft":1278,"ms":1279,"71":1280,"54":1281,"median":1282,"88":1283,"p99":1284,"79":1285,"49":1286,"per":1287,"excl":1288,"1st":1289,"tpot":1290,"91":1291,"96":1292,"inter":1293,"itl":1294,"74":1295,"70":1296,"39":1297,"want":1298,"yet":1299,"even":1300,"customdataset":1301,"needs":1302,"prompt":1303,"field":1304,"entry":1305,"india":1306,"iran":1307,"vllm_use_v1":1308,"instruct":1309,"port":1310,"9001":1311,"save":1312,"detailed":1313,"skip":1314,"template":1315,"80":1316,"max":1317,"concurrency":1318,"temperature":1319,"top":1320,"75":1321,"dir":1322,"log":1323,"applying":1324,"already":1325,"vision":1326,"capability":1327,"qwen":1328,"qwen2":1329,"vl":1330,"7b":1331,"split":1332,"1000":1333,"config":1334,"method":1335,"ngram":1336,"num_speculative_tokens":1337,"prompt_lookup_max":1338,"prompt_lookup_min":1339,"2048":1340,"huggingfacedataset":1341,"subset":1342,"chart2text":1343,"cauldron":1344,"qwq":1345,"32b":1346,"seed":1347,"42":1348,"philschmid":1349,"mt":1350,"parameters":1351,"backends":1352,"client":1353,"command":1354,"ramp":1355,"up":1356,"rate":1357,"tool":1358,"ramping":1359,"over":1360,"useful":1361,"stress":1362,"finding":1363,"maximum":1364,"handle":1365,"given":1366,"budget":1367,"two":1368,"strategies":1369,"linear":1370,"increases":1371,"linearly":1372,"exponential":1373,"exponentially":1374,"arguments":1375,"strategy":1376,"rps":1377,"beginning":1378,"4656":1379,"00":1380,"1072":1381,"5014":1382,"1500":1383,"counts":1384,"4036":1385,"92":1386,"326":1387,"90":1388,"14527":1389,"1280":1390,"vllm_worker_multiproc_method":1391,"spawn":1392,"len":1393,"engine":1394,"104":1395,"77":1396,"23836":1397,"10477":1398,"261136":1399,"204800":1400,"adapters":1401,"dataset_path":1402,"dataset_name":1403,"loras":1404,"rank":1405,"enable":1406,"yard1":1407,"sql":1408,"structured":1409,"generation":1410,"grammar":1411,"regex":1412,"schema":1413,"python3":1414,"benchmark_serving_structured_output":1415,"py":1416,"ratio":1417,"structure":1418,"choice":1419,"xgrammar":1420,"xgrammar_bench":1421,"long":1422,"qa":1423,"question":1424,"answering":1425,"basic":1426,"benchmark_long_document_qa_throughput":1427,"documents":1428,"length":1429,"2000":1430,"50":1431,"repeat":1432,"different":1433,"mode":1434,"default":1435,"shuffle":1436,"randomly":1437,"3000":1438,"tile":1439,"entire":1440,"sequence":1441,"interleave":1442,"consecutively":1443,"efficiency":1444,"automatic":1445,"fixed":1446,"benchmark_prefix_caching":1447,"range":1448,"128":1449,"256":1450,"prefix_repetition":1451,"512":1452,"suffix":1453,"prefixes":1454,"prioritization":1455,"benchmark_prioritization":1456,"64":1457,"scheduling":1458,"priority":1459,"sequences":1460,"python":1461,"entrypoints":1462,"api_server":1463,"dtype":1464,"bfloat16":1465,"limit":1466,"mm":1467,"benchmark_serving":1468,"vllm_benchmark_results":1469,"completion":1470,"cluster":1471,"described":1472,"2412":1473,"19437":1474,"way":1475,"deploy":1476,"sparse":1477,"moe":1478,"many":1479,"experts":1480,"however":1481,"requires":1482,"components":1483,"beyond":1484,"normal":1485,"package":1486,"driver":1487,"impossible":1488,"bundle":1489,"break":1490,"down":1491,"requirements":1492,"steps":1493,"libraries":1494,"pplx":1495,"ppl":1496,"deepep":1497,"necessary":1498,"dependencies":1499,"nvshmem":1500,"ibgda":1501,"root":1502,"must":1503,"done":1504,"host":1505,"machine":1506,"scripts":1507,"accept":1508,"positional":1509,"argument":1510,"workspace":1511,"staging":1512,"defaulting":1513,"pwd":1514,"ep_kernels_workspace":1515,"hopper":1516,"torch_cuda_arch_list":1517,"install_python_libraries":1518,"sh":1519,"blackwell":1520,"additional":1521,"sudo":1522,"configure_system_drivers":1523,"reboot":1524,"load":1525,"gputrc2graph":1526,"processes":1527,"nsight":1528,"nsys":1529,"trace":1530,"files":1531,"rep":1532,"tracing":1533,"enabled":1534,"generates":1535,"kernel":1536,"summaries":1537,"visualizations":1538,"profiling":1539,"analyzing":1540,"profile":1541,"line":1542,"in_file":1543,"metadata":1544,"elapsed_nonprofiled_sec":1545,"gpt":1546,"oss":1547,"ds":1548,"wall":1549,"clock":1550,"runtime":1551,"seconds":1552,"specify":1553,"elapsed":1554,"inflate":1555,"actual":1556,"entries":1557,"provided":1558,"separated":1559,"out_dir":1560,"directory":1561,"saved":1562,"chart":1563,"visualization":1564,"nsys_cmd":1565,"assumes":1566,"sure":1567,"pandas":1568,"installed":1569,"engines":1570,"help":1571,"string":1572,"analyze":1573,"cycles":1574,"say":1575,"collect":1576,"run1":1577,"exec":1578,"delay":1579,"120b":1580,"collecting":1581,"profiles":1582,"so":1583,"aren":1584,"captured":1585,"till":1586,"come":1587,"starts":1588,"generating":1589,"again":1590,"calculate":1591,"cpu":1592,"analysis":1593,"306":1594,"produce":1595,"categorizes":1596,"names":1597,"stacked":1598,"bar":1599,"shows":1600,"mapped":1601,"number":1602,"due":1603,"substages":1604,"consist":1605,"moe_gemm":1606,"gemm":1607,"biggest":1608,"category":1609,"148":1610,"followed":1611,"attn":1612,"lets":1613,"prioritize":1614,"focus":1615,"optimizations":1616,"appended":1617,"underneath":1618,"processing":1619,"tools":1620,"html_tbl":1621,"mapping":1622,"suppose":1623,"improving":1624,"triton":1625,"consumer":1626,"sec":1627,"perhaps":1628,"hasn":1629,"been":1630,"next":1631,"dive":1632,"compose":1633,"triton_poi_fused__to_copy_add_addmm_cat_":1634,"csv1":1635,"something":1636,"run2":1637,"102":1638,"stack":1639,"charts":1640,"compared":1641,"remain":1642,"shown":1643,"one":1644,"configuration":1645,"another":1646,"largest":1647,"amount":1648,"difference":1649,"add":1650,"classification":1651,"abc":1652,"def":1653,"classified":1654,"engine_model":1655,"layer_anno":1656,"stage":1657,"layer":1658,"substage":1659,"mem":1660,"h_d_memops":1661,"misc":1662,"basically":1663,"dictionary":1664,"pairs":1665,"keys":1666,"values":1667,"bins":1668,"wishes":1669,"across":1670,"last":1671,"consisting":1672,"operations":1673,"anything":1674,"leftover":1675,"invoking":1676,"infile":1677,"kv":1678,"cache":1679,"offloading":1680,"turn":1681,"conversations":1682,"benchmark_serving_multi_turn":1683,"found":1684,"export":1685,"model_name":1686,"gutenberg":1687,"ebooks":1688,"1184":1689,"utf":1690,"mv":1691,"pg1184":1692,"filename":1693,"generate_multi_turn":1694,"text_files":1695,"prefer":1696,"clients":1697,"active":1698,"conversation":1699,"turns":1700,"etc":1701,"statistics":1702,"runtime_sec":1703,"215":1704,"810":1705,"requests_per_sec":1706,"769":1707,"std":1708,"min":1709,"25":1710,"99":1711,"ttft_ms":1712,"166":1713,"67":1714,"63":1715,"45":1716,"59":1717,"94":1718,"62":1719,"26":1720,"43":1721,"69":1722,"66":1723,"353":1724,"567":1725,"tpot_ms":1726,"37":1727,"57":1728,"24":1729,"40":1730,"31":1731,"84":1732,"28":1733,"latency_ms":1734,"2591":1735,"1998":1736,"53":1737,"2341":1738,"2573":1739,"2860":1740,"3003":1741,"3268":1742,"46":1743,"3862":1744,"input_num_turns":1745,"input_num_tokens":1746,"2006":1747,"893":1748,"56":1749,"522":1750,"1247":1751,"2019":1752,"2718":1753,"3233":1754,"3736":1755,"3899":1756,"output_num_tokens":1757,"109":1758,"116":1759,"120":1760,"output_num_chunks":1761,"98":1762,"108":1763,"115":1764,"119":1765,"sharegpt_20230401_clean_lang_split":1766,"convert_sharegpt_to_openai":1767,"convert":1768,"sharegpt_conv_128":1769,"items":1770,"standard":1771,"assistant":1772,"roles":1773,"flag":1774,"sample":1775,"original":1776,"automated":1777,"parameter":1778,"tuning":1779,"automates":1780,"optimal":1781,"combination":1782,"seqs":1783,"batched":1784,"maximize":1785,"constraints":1786,"hit":1787,"contents":1788,"prerequisites":1789,"works":1790,"completed":1791,"clone":1792,"desired":1793,"git":1794,"cd":1795,"checkout":1796,"update":1797,"correct":1798,"activate":1799,"conda":1800,"torch":1801,"torch_xla":1802,"customized":1803,"its":1804,"correctly":1805,"placed":1806,"accessible":1807,"variables":1808,"variable":1809,"description":1810,"absolute":1811,"parent":1812,"home":1813,"identifier":1814,"served":1815,"choices":1816,"might":1817,"saving":1818,"tp":1819,"download_dir":1820,"weights":1821,"input_len":1822,"4000":1823,"output_len":1824,"max_model_len":1825,"4096":1826,"min_cache_hit_pct":1827,"percentage":1828,"max_latency_allowed_ms":1829,"milliseconds":1830,"very":1831,"100000000000":1832,"effectively":1833,"ignore":1834,"constraint":1835,"500":1836,"num_seqs_list":1837,"space":1838,"num_batched_tokens_list":1839,"1024":1840,"medium":1841,"sized":1842,"inputs":1843,"short":1844,"larger":1845,"section":1846,"highly":1847,"recommended":1848,"terminal":1849,"multiplexer":1850,"tmux":1851,"screen":1852,"prevent":1853,"stopping":1854,"connection":1855,"lost":1856,"folder_of_this_script":1857,"auto_tune":1858,"cannot":1859,"keyword":1860,"pkill":1861,"kill":1862,"itself":1863,"goals":1864,"goal":1865,"highest":1866,"possible":1867,"1800":1868,"requirement":1869,"500ms":1870,"assuming":1871,"finishes":1872,"timestamped":1873,"inside":1874,"auto":1875,"yyyy_mm_dd_hh_mm":1876,"logs":1877,"vllm_log_":1878,"bm_log_":1879,"named":1880,"tested":1881,"concludes":1882,"content":1883,"a1b2c3d4":1884,"max_num_seqs":1885,"max_num_batched_tokens":1886,"request_rate":1887,"e2el":1888,"450":1889,"goodput":1890,"meet":1891,"best_max_num_seqs":1892,"best_num_batched_tokens":1893,"best_throughput":1894,"2024_08_01_10_30":1895,"row":1896,"properly":1897,"too":1898,"strict":1899,"profiler":1900,"xplane":1901,"pb":1902,"performing":1903,"follows":1904,"systematic":1905,"utilization":1906,"determines":1907,"safe":1908,"decreasing":1909,"oom":1910,"error":1911,"launching":1912,"ensures":1913,"runs":1914,"crashing":1915,"iterate":1916,"enters":1917,"nested":1918,"iterating":1919,"aware":1920,"infinite":1921,"inf":1922,"resulting":1923,"performs":1924,"iteratively":1925,"until":1926,"met":1927,"finds":1928,"sustainable":1929,"throughout":1930,"tracks":1931,"yielded":1932,"valid":1933,"far":1934,"collection":1935,"saves":1936,"deep":1937,"tensorboard":1938,"deepgemm":1939,"block":1940,"existing":1941,"cutlass":1942,"currently":1943,"dense":1944,"gemms":1945,"usual":1946,"fashion":1947,"own":1948,"recursive":1949,"uv":1950,"console":1951,"benchmark_fp8_block_dense_gemm":1952,"info":1953,"__init__":1954,"207":1955,"automatically":1956,"detected":1957,"platform":1958,"cu124":1959,"device":1960,"80gb":1961,"hbm3":1962,"fp8_utils":1963,"458":1964,"w8a8":1965,"sub":1966,"mgoin":1967,"model_executor":1968,"layers":1969,"utils":1970,"configs":1971,"7168":1972,"device_name":1973,"nvidia_h100_80gb_hbm3":1974,"fp8_w8a8":1975,"block_shape":1976,"449":1977,"18432":1978,"24576":1979,"1536":1980,"32768":1981,"16384":1982,"implementation":1983,"μs":1984,"tflops":1985,"gb":1986,"286":1987,"29":1988,"1868":1989,"1911":1990,"439":1991,"243":1992,"1933":1993,"240":1994,"1917":1995,"68":1996,"584":1997,"307":1998,"216":1999,"1718":2000,"141":2001,"222":2002,"470":2003,"1896":2004,"488":2005,"1988":2006,"670":2007,"502":2008,"279":2009,"969":2010,"635":2011,"175":2012,"687":2013,"347":2014,"335":2015,"717":2016,"275":2017,"398":2018,"39x":2019,"faster":2020,"1478":2021,"79x":2022,"slower":2023,"113":2024,"1170":2025,"61x":2026,"47":2027,"87x":2028,"171":2029,"1363":2030,"70x":2031,"1129":2032,"59x":2033,"1089":2034,"86x":2035,"38":2036,"542":2037,"77x":2038,"86":2039,"174":2040,"1386":2041,"81x":2042,"82":2043,"345":2044,"56x":2045,"144":2046,"234":2047,"946":2048,"50x":2049,"229":2050,"147":2051,"600":2052,"30x":2053,"242":2054,"248":2055,"186":2056,"37x":2057,"897":2058,"301":2059,"197":2060,"31x":2061,"463":2062,"259":2063,"131":2064,"38x":2065,"901":2066,"266":2067,"34":2068,"852":2069,"98x":2070,"14x":2071,"1677":2072,"90x":2073,"13x":2074,"81":2075,"1631":2076,"85x":2077,"36":2078,"101":2079,"822":2080,"15x":2081,"87":2082,"193":2083,"1535":2084,"199":2085,"1587":2086,"83x":2087,"41x":2088,"172":2089,"1465":2090,"51x":2091,"35x":2092,"728":2093,"34x":2094,"1532":2095,"89x":2096,"11x":2097,"192":2098,"802":2099,"32x":2100,"93":2101,"360":2102,"1454":2103,"54x":2104,"394":2105,"1608":2106,"68x":2107,"603":2108,"452":2109,"43x":2110,"331":2111,"816":2112,"534":2113,"84x":2114,"71x":2115,"198":2116,"606":2117,"88x":2118,"392":2119,"613":2120,"235":2121,"average":2122,"avg":2123,"310":2124,"1052":2125,"715":2126,"1076":2127,"speedups":2128,"94x":2129,"accuracy":2130,"diff":2131,"reference":2132,"000684":2133,"resolver":2134,"plugins":2135,"general":2136,"dynamically":2137,"discovering":2138,"loading":2139,"loraresolver":2140,"plugin":2141,"framework":2142,"vllm_allow_runtime_lora_updating":2143,"vllm_plugins":2144,"lora_filesystem_resolver":2145,"vllm_plugin_lora_cache_dir":2146,"receives":2147,"adapter":2148,"foobar":2149,"doesn":2150,"recognize":2151,"look":2152,"subdirectory":2153,"containing":2154,"exists":2155,"transfer":2156,"folder":2157,"implements":2158,"usecase":2159,"disaggregated":2160,"prefilling":2161,"abstractions":2162,"three":2163,"pipe":2164,"fifo":2165,"transmission":2166,"apis":2167,"send_tensor":2168,"recv_tensor":2169,"lookup":2170,"buffer":2171,"caches":2172,"hidden":2173,"states":2174,"insert":2175,"drop_select":2176,"semantics":2177,"connector":2178,"connects":2179,"send_kv_caches_and_hidden_states":2180,"recv_kv_caches_and_hidden_states":2181,"enough":2182,"worker":2183,"decode":2184,"qps":2185,"really":2186,"naturally":2187,"handled":2188,"provide":2189,"translate":2190,"bypassible":2191,"redis":2192,"rdma":2193,"database":2194,"adjust":2195,"flow":2196,"receive":2197,"bypass":2198,"directly":2199,"implement":2200,"bear":2201,"mind":2202,"constantly":2203,"changing":2204,"likely":2205,"broken":2206,"updates":2207,"online_serving":2208,"disaggregated_prefill":2209,"diagram":2210,"disagg_prefill_workflow":2211,"jpg":2212,"chosen":2213,"docker":2214,"patterns":2215,"offline_inference":2216,"instance":2217,"production":2218,"training":2219,"rlhf":2220,"fine":2221,"tune":2222,"troubleshooting":2223,"outlines":2224,"consider":2225,"think":2226,"ve":2227,"discovered":2228,"3aissue":2229,"choose":2230,"much":2231,"relevant":2232,"debugged":2233,"problem":2234,"remember":2235,"off":2236,"debugging":2237,"defined":2238,"simply":2239,"shell":2240,"avoid":2241,"lingering":2242,"settings":2243,"slow":2244,"functionalities":2245,"activated":2246,"hangs":2247,"downloading":2248,"isn":2249,"disk":2250,"internet":2251,"depend":2252,"cli":2253,"huggingface_hub":2254,"passing":2255,"isolate":2256,"pay":2257,"store":2258,"clusters":2259,"shared":2260,"filesystems":2261,"nodes":2262,"filesystem":2263,"better":2264,"additionally":2265,"lot":2266,"slowing":2267,"because":2268,"frequently":2269,"swap":2270,"dummy":2271,"bottleneck":2272,"fit":2273,"adopting":2274,"options":2275,"conserving_memory":2276,"reduce":2277,"consumption":2278,"quality":2279,"changed":2280,"gh":2281,"12622":2282,"prior":2283,"came":2284,"neutral":2285,"onwards":2286,"generation_config":2287,"creator":2288,"higher":2289,"responses":2290,"know":2291,"degraded":2292,"happening":2293,"trying":2294,"old":2295,"improves":2296,"continuing":2297,"petition":2298,"produces":2299,"generations":2300,"don":2301,"solve":2302,"stuck":2303,"somewhere":2304,"debug":2305,"vllm_logging_level":2306,"vllm_log_stats_interval":2307,"tracking":2308,"queue":2309,"waiting":2310,"cuda_launch_blocking":2311,"identify":2312,"causing":2313,"nccl_debug":2314,"nccl":2315,"vllm_trace_function":2316,"record":2317,"function":2318,"calls":2319,"inspection":2320,"tell":2321,"unless":2322,"absolutely":2323,"delays":2324,"startup":2325,"incorrect":2326,"ip":2327,"complicated":2328,"32":2329,"parallel_state":2330,"world_size":2331,"local_rank":2332,"distributed_init_method":2333,"tcp":2334,"xxx":2335,"54641":2336,"override":2337,"vllm_host_ip":2338,"your_ip_address":2339,"nccl_socket_ifname":2340,"your_network_interface":2341,"gloo_socket_ifname":2342,"interface":2343,"near":2344,"self":2345,"replay":2346,"captures":2347,"model_runner":2348,"cudagraph":2349,"particular":2350,"operation":2351,"causes":2352,"enforce":2353,"eager":2354,"enforce_eager":2355,"optimization":2356,"exact":2357,"established":2358,"instructions":2359,"confirm":2360,"whether":2361,"working":2362,"import":2363,"dist":2364,"init_process_group":2365,"get_rank":2366,"device_count":2367,"set_device":2368,"floattensor":2369,"all_reduce":2370,"op":2371,"reduceop":2372,"sum":2373,"synchronize":2374,"item":2375,"get_world_size":2376,"assert":2377,"expected":2378,"got":2379,"print":2380,"gloo":2381,"gloo_group":2382,"new_group":2383,"ranks":2384,"cpu_data":2385,"exit":2386,"device_communicators":2387,"pynccl":2388,"pyncclcommunicator":2389,"manually":2390,"backward":2391,"read":2392,"disabled":2393,"false":2394,"stream":2395,"fill_":2396,"cuda_graph":2397,"current_stream":2398,"destroy_process_group":2399,"nproc":2400,"torchrun":2401,"nnodes":2402,"according":2403,"master_addr":2404,"master":2405,"reachable":2406,"rdzv_backend":2407,"c10d":2408,"rdzv_endpoint":2409,"successfully":2410,"message":2411,"sanity":2412,"usually":2413,"means":2414,"drivers":2415,"sense":2416,"try":2417,"administrator":2418,"further":2419,"assistance":2420,"workaround":2421,"nccl_p2p_disable":2422,"helps":2423,"deeplearning":2424,"env":2425,"solution":2426,"still":2427,"fix":2428,"distnetworkerror":2429,"dns":2430,"assign":2431,"commands":2432,"multiprocessing":2433,"runtimeerror":2434,"seen":2435,"multiproc_worker_utils":2436,"281":2437,"initialized":2438,"looks":2439,"attempt":2440,"finished":2441,"bootstrapping":2442,"phase":2443,"probably":2444,"child":2445,"forgotten":2446,"proper":2447,"idiom":2448,"module":2449,"__name__":2450,"__main__":2451,"freeze_support":2452,"omitted":2453,"program":2454,"going":2455,"frozen":2456,"executable":2457,"importing":2458,"guard":2459,"behind":2460,"instead":2461,"compile":2462,"heavily":2463,"optimize":2464,"introduces":2465,"dependency":2466,"functionality":2467,"functions":2468,"10406":2469,"simple":2470,"sin":2471,"return":2472,"randn":2473,"raises":2474,"_inductor":2475,"12219":2476,"failed":2477,"inspected":2478,"registry":2479,"_raise_for_unsupported":2480,"raise":2481,"valueerror":2482,"architectures":2483,"arch":2484,"related":2485,"missing":2486,"outdated":2487,"binaries":2488,"carefully":2489,"traceback":2490,"call":2491,"inspect_model_cls":2492,"typeerror":2493,"nonetype":2494,"object":2495,"iterable":2496,"resolution":2497,"model_resolution":2498,"explicitly":2499,"infer":2500,"platforms":2501,"infers":2502,"14195":2503,"unhandled":2504,"ncclcomminitrank":2505,"workload":2506,"gpudirect":2507,"encounters":2508,"executing":2509,"init_device":2510,"deadlock":2511,"usr":2512,"lib":2513,"packages":2514,"comm":2515,"ncclcomm_t":2516,"pynccl_wrapper":2517,"277":2518,"nccl_check":2519,"_funcs":2520,"ctypes":2521,"byref":2522,"error_str":2523,"indicates":2524,"initialize":2525,"communicator":2526,"possibly":2527,"ipc_lock":2528,"linux":2529,"unmounted":2530,"dev":2531,"shm":2532,"enabling":2533,"parallelism_scaling":2534,"guidance":2535,"configuring":2536,"known":2537,"caused":2538,"zmq":2539,"zeromq":2540,"pyzmq":2541,"occasionally":2542,"hang":2543,"depending":2544,"6759":2545,"circumvent":2546,"1234":2547,"nccl_cumem_enable":2548,"cumem":2549,"allocator":2550,"gives":2551,"benefits":2552,"inconsistent":2553,"crash":2554,"observed":2555,"openrlhf":2556,"pull":2557,"604":2558,"discussion":2559,"5723":2560,"issuecomment":2561,"2554389656":2562,"deprecating":2563,"rfc":2564,"18571":2565,"gradually":2566,"share":2567,"inviter":2568,"reason":2569,"wide":2570,"independently":2571,"grew":2572,"increasingly":2573,"complex":2574,"complexity":2575,"harder":2576,"integrate":2577,"capabilities":2578,"debt":2579,"revealing":2580,"streamlined":2581,"unified":2582,"design":2583,"building":2584,"success":2585,"retains":2586,"proven":2587,"utilities":2588,"re":2589,"architects":2590,"core":2591,"covering":2592,"scheduler":2593,"manager":2594,"sampler":2595,"cohesive":2596,"maintainable":2597,"accommodates":2598,"growth":2599,"innovation":2600,"specifically":2601,"aims":2602,"modular":2603,"hack":2604,"codebase":2605,"combine":2606,"architecture":2607,"upgrading":2608,"context":2609,"scenarios":2610,"published":2611,"important":2612,"limitations":2613,"actively":2614,"bring":2615,"therefore":2616,"progress":2617,"towards":2618,"falls":2619,"nearly":2620,"fully":2621,"planned":2622,"operational":2623,"ongoing":2624,"wip":2625,"scheduled":2626,"rfcs":2627,"delayed":2628,"temporarily":2629,"dropped":2630,"later":2631,"demand":2632,"treats":2633,"request_id":2634,"num_tokens":2635,"allocate":2636,"prefills":2637,"separation":2638,"phases":2639,"policies":2640,"fcfs":2641,"processed":2642,"assigned":2643,"tie":2644,"breaker":2645,"configurable":2646,"nobr":2647,"x86":2648,"_64":2649,"aarch64":2650,"macos":2651,"ascend":2652,"spyre":2653,"openvino":2654,"repositories":2655,"decoder":2656,"encoder":2657,"mamba":2658,"excludes":2659,"supportsv0only":2660,"protocol":2661,"tip":2662,"corresponds":2663,"column":2664,"initial":2665,"processor":2666,"12249":2667,"global":2668,"logits":2669,"13360":2670,"simultaneous":2671,"selective":2672,"mechanisms":2673,"mamba2forcausallm":2674,"mambaforcausallm":2675,"disabling":2676,"bambaforcausallm":2677,"zamba2forcausallm":2678,"nemotronhforcausallm":2679,"falconh1forcausallm":2680,"granitemoehybridforcausallm":2681,"jambaforcausallm":2682,"hybrid":2683,"minimaxtext01forcausallm":2684,"minimaxm1forcausallm":2685,"requiring":2686,"cross":2687,"separate":2688,"bartforconditionalgeneration":2689,"mllamaforconditionalgeneration":2690,"logprobs":2691,"calculation":2692,"devices":2693,"15191":2694,"spec":2695,"13414":2696,"alternative":2697,"best_of":2698,"13361":2699,"processors":2700,"swapping":2701,"semantic":2702,"differences":2703,"returned":2704,"immediately":2705,"computed":2706,"scaling":2707,"penalty":2708,"adjustments":2709,"reflect":2710,"adjusted":2711,"probabilities":2712,"turned":2713,"recomputation":2714,"recover":2715,"upon":2716,"part":2717,"rework":2718,"several":2719,"legacy":2720,"pass":2721,"moving":2722,"simplified":2723,"longer":2724,"preemptions":2725,"fallbacks":2726,"communications":2727,"insecure":2728,"protected":2729,"placing":2730,"isolated":2731,"sets":2732,"127":2733,"14579":2734,"data_parallel_master_ip":2735,"data_parallel_master_port":2736,"29500":2737,"considerations":2738,"points":2739,"intended":2740,"internal":2741,"untrusted":2742,"environments":2743,"networks":2744,"authorization":2745,"messages":2746,"sent":2747,"unencrypted":2748,"connections":2749,"accepted":2750,"anywhere":2751,"checks":2752,"isolation":2753,"segmentation":2754,"unauthorized":2755,"firewall":2756,"rules":2757,"practices":2758,"always":2759,"rather":2760,"firewalls":2761,"ports":2762,"restrict":2763,"authentication":2764,"interfaces":2765,"principle":2766,"least":2767,"protecting":2768,"exposed":2769,"designed":2770,"unsafe":2771,"services":2772,"underlying":2773,"frameworks":2774,"listening":2775,"sometimes":2776,"outside":2777,"direct":2778,"concern":2779,"leverages":2780,"initialization":2781,"creates":2782,"tcpstore":2783,"listens":2784,"protections":2785,"put":2786,"place":2787,"reach":2788,"perspective":2789,"intentional":2790,"protect":2791,"expose":2792,"minimum":2793,"surface":2794,"area":2795,"except":2796,"trusted":2797,"hosts":2798,"never":2799,"consult":2800,"application":2801,"believe":2802,"reproducibility":2803,"guarantee":2804,"sake":2805,"achieve":2806,"reproducible":2807,"deterministic":2808,"vllm_enable_v1_multiprocessing":2809,"above":2810,"locality":2811,"provides":2812,"almost":2813,"generators":2814,"np":2815,"manual_seed":2816,"accordingly":2817,"none":2818,"un":2819,"workers":2820,"17929":2821,"constructs":2822,"having":2823,"worry":2824,"accidentally":2825,"making":2826,"subsequent":2827,"rely":2828,"stats":2829,"collects":2830,"anonymous":2831,"engineering":2832,"understand":2833,"widely":2834,"allows":2835,"efforts":2836,"workloads":2837,"collected":2838,"transparent":2839,"sensitive":2840,"cleaning":2841,"aggregation":2842,"publicly":2843,"benefit":2844,"usage_lib":2845,"uuid":2846,"fbe880e9":2847,"084d":2848,"4cab":2849,"a395":2850,"8984c50f1109":2851,"provider":2852,"gcp":2853,"num_cpu":2854,"cpu_type":2855,"xeon":2856,"20ghz":2857,"cpu_family_model_stepping":2858,"total_memory":2859,"101261135872":2860,"x86_64":2861,"amd64":2862,"glibc2":2863,"gpu_count":2864,"gpu_type":2865,"l4":2866,"gpu_memory_per_device":2867,"23580639232":2868,"model_architecture":2869,"optforcausallm":2870,"vllm_version":2871,"cu123":2872,"llm_class":2873,"log_time":2874,"1711663373492490000":2875,"float16":2876,"tensor_parallel_size":2877,"block_size":2878,"gpu_memory_utilization":2879,"null":2880,"kv_cache_dtype":2881,"enable_lora":2882,"enable_prefix_caching":2883,"disable_custom_all_reduce":2884,"preview":2885,"tail":2886,"usage_stats":2887,"opting":2888,"opt":2889,"vllm_no_usage_stats":2890,"do_not_track":2891,"creating":2892,"methods":2893,"mkdir":2894,"touch":2895,"metrics":2896,"exposes":2897,"health":2898,"unsloth":2899,"1b":2900,"query":2901,"curl":2902,"8000":2903,"iteration_tokens_total":2904,"histogram":2905,"engine_step":2906,"iteration_tokens_total_sum":2907,"iteration_tokens_total_bucket":2908,"le":2909,"definitions":2910,"escape":2911,"hatch":2912,"removed":2913,"asked":2914,"referring":2915,"route":2916,"intfloat":2917,"baai":2918,"bge":2919,"listed":2920,"extracting":2921,"mistralai":2922,"inferior":2923,"trained":2924,"tasks":2925,"vary":2926,"yes":2927,"variations":2928,"occur":2929,"numerical":2930,"instability":2931,"numerical_accuracy":2932,"computations":2933,"slice":2934,"differently":2935,"factors":2936,"concurrent":2937,"batch":2938,"expansion":2939,"combined":2940,"slightly":2941,"logit":2942,"logprob":2943,"accumulate":2944,"potentially":2945,"sampled":2946,"divergence":2947,"mitigation":2948,"improved":2949,"stability":2950,"reduced":2951,"variance":2952,"float32":2953,"switching":2954,"seeds":2955,"aid":2956,"achieving":2957,"discrepancies":2958,"precision":2959,"levels":2960,"lowest":2961,"params":2962,"engine_args":2963,"env_vars":2964,"covers":2965,"conserve":2966,"preemption":2967,"regressive":2968,"times":2969,"insufficient":2970,"preempt":2971,"preempted":2972,"recomputed":2973,"becomes":2974,"occurs":2975,"33":2976,"1057":2977,"preemptionmode":2978,"recompute":2979,"increase":2980,"total_cumulative_preemption_cnt":2981,"mechanism":2982,"robustness":2983,"adversely":2984,"encounter":2985,"pre":2986,"allocates":2987,"increasing":2988,"decrease":2989,"reduces":2990,"thereby":2991,"shards":2992,"allowing":2993,"excessive":2994,"synchronization":2995,"pipeline_parallel_size":2996,"distributes":2997,"indirectly":2998,"leaving":2999,"penalties":3000,"prometheus":3001,"cumulative":3002,"disable_log_stats":3003,"lower":3004,"smaller":3005,"chunks":3006,"together":3007,"improve":3008,"balancing":3009,"bound":3010,"conditionally":3011,"prioritizes":3012,"batches":3013,"pending":3014,"schedules":3015,"prioritized":3016,"locating":3017,"adjusting":3018,"fewer":3019,"decodes":3020,"8096":3021,"especially":3022,"equivalent":3023,"papers":3024,"pdf":3025,"2401":3026,"08671":3027,"2308":3028,"16369":3029,"pressure":3030,"70b":3031,"essential":3032,"pp":3033,"parts":3034,"maxed":3035,"distribute":3036,"narrow":3037,"distribution":3038,"sharding":3039,"ep":3040,"specialized":3041,"deepseekv3":3042,"qwen3moe":3043,"balance":3044,"computation":3045,"enable_expert_parallel":3046,"degree":3047,"dp":3048,"replicates":3049,"beneficial":3050,"data_parallel_size":3051,"sharded":3052,"product":3053,"data_parallel_deployment":3054,"excess":3055,"capacity":3056,"3b":3057,"correspondance":3058,"repeatedly":3059,"autoprocessor":3060,"commonly":3061,"mm_processor_cache_gb":3062,"gib":3063,"completely":3064,"toc_depth":3065,"openai_compatible_server":3066,"engineargs":3067,"arg_utils":3068,"asyncengineargs":3069,"interested":3070,"truth":3071,"types":3072,"docstrings":3073,"json_tip":3074,"inc":3075,"argparse":3076,"async_engine_args":3077,"vllm_port":3078,"prefixed":3079,"vllm_":3080,"care":3081,"taken":3082,"kubernetes":3083,"conflict":3084,"capitalized":3085,"concepts":3086,"networking":3087,"envs":3088,"vars":3089,"definition":3090,"tips":3091,"doc":3092,"serves":3093,"handy":3094,"optimizing":3095,"google_tpu":3096,"sizing":3097,"selecting":3098,"ideal":3099,"chips":3100,"adequate":3101,"hbm":3102,"colab":3103,"calculator":3104,"ericehanley":3105,"rightsize":3106,"hbm_calculator":3107,"ipynb":3108,"consumed":3109,"allocated":3110,"approximately":3111,"rule":3112,"thumb":3113,"tradeoff":3114,"rightsizing":3115,"defines":3116,"limiting":3117,"simultaneously":3118,"crucial":3119,"compilation":3120,"coming":3121,"background":3122,"ll":3123,"notice":3124,"tpus":3125,"asics":3126,"compiled":3127,"static":3128,"graphs":3129,"xla":3130,"compiler":3131,"unlike":3132,"dynamic":3133,"shapes":3134,"flexibly":3135,"shape":3136,"manage":3137,"warmup":3138,"launch":3139,"compiles":3140,"storage":3141,"located":3142,"xla_cache":3143,"minutes":3144,"hour":3145,"although":3146,"launches":3147,"eliminating":3148,"vllm_xla_cache_path":3149,"shareable":3150,"deployed":3151,"autoscaling":3152,"ranges":3153,"impacted":3154,"discussed":3155,"influence":3156,"things":3157,"vllm_tpu_most_model_len":3158,"most_model_len":3159,"shorter":3160,"accommodate":3161,"occasional":3162,"negatively":3163,"introducing":3164,"specifying":3165,"32k":3166,"2k":3167,"subdivided":3168,"latter":3169,"gain":3170,"padding":3171,"bucket":3172,"vllm_tpu_bucket_padding_gap":3173,"layout":3174,"increments":3175,"pads":3176,"lengths":3177,"sending":3178,"recompilation":3179,"efficiencies":3180,"pad":3181,"nearest":3182,"buckets":3183,"increment":3184,"padding_gap":3185,"320":3186,"384":3187,"448":3188,"unnecessary":3189,"300":3190,"bucket_padding":3191,"careful":3192,"gap":3193,"small":3194,"leading":3195,"increased":3196,"precompile":3197,"compilaed":3198,"conversely":3199,"overly":3200,"yields":3201,"improvement":3202,"matches":3203,"chip":3204,"acceleration":3205,"v5e":3206,"mxu":3207,"v6e":3208,"quantized":3209,"formats":3210,"w8a16":3211,"fp4":3212,"w4a8":3213,"parallelization":3214,"fragment":3215,"create":3216,"great":3217,"strongly":3218,"tuner":3219,"topics":3220,"cover":3221,"interpreting":3222,"challenging":3223,"expand":3224,"meantime":3225,"native":3226,"profiling_tpu":3227,"valuable":3228,"insights":3229,"spmd":3230,"love":3231,"hear":3232,"conserving":3233,"alleviate":3234,"option":3235,"splits":3236,"granite":3237,"initializes":3238,"calling":3239,"initializing":3240,"subprocess":3241,"cuda_visible_devices":3242,"whole":3243,"makes":3244,"reading":3245,"proportional":3246,"checkpoint":3247,"save_sharded_state":3248,"conversion":3249,"constant":3250,"cost":3251,"statically":3252,"hub":3253,"ones":3254,"red":3255,"hat":3256,"redhatai":3257,"extra":3258,"adept":3259,"fuyu":3260,"capture":3261,"takes":3262,"compilation_config":3263,"speed":3264,"compilationconfig":3265,"compilationlevel":3266,"piecewise":3267,"goes":3268,"cudagraph_capture_sizes":3269,"capturing":3270,"ram":3271,"vllm_cpu_kvcache_space":3272,"limits":3273,"footprint":3274,"video":3275,"limit_mm_per_prompt":3276,"go":3277,"unused":3278,"modalities":3279,"accepts":3280,"videos":3281,"gemma":3282,"27b":3283,"mm_processor_kwargs":3284,"max_pixels":3285,"768":3286,"internvl":3287,"opengvlab":3288,"internvl2":3289,"2b":3290,"max_dynamic_patch":3291,"yaml":3292,"outlined":3293,"serve_args":3294,"6379":3295,"uvicorn":3296,"supplied":3297,"precedence":3298,"priorities":3299,"some_model":3300,"loads":3301,"inspecting":3302,"registered":3303,"nevertheless":3304,"fail":3305,"lacks":3306,"unofficial":3307,"recorded":3308,"ambiguity":3309,"loaded":3310,"overrides":3311,